# frozen_string_literal: true

MAIN_MENU = [
  '0.Добавить станцию',
  '1.Добавить поезд',
  '2.Добавить вагон',
  '3.Управление маршрутом',
  '4.Назначить маршрут поезду',
  '5.Добавить вагон к поезду',
  '6.Отцепить вагон от поезда',
  '7.Перемеcтить поезд по маршруту',
  '8.Просмотреть список станций',
  '9.список поездов на станции',
  '10.Список вагонов поезда',
  '11.Занять место/объем',
  '12.Для выхода из программы'
].freeze
ASK_LIST_ITEM = 'Выберите пункт из списка:'
WRONG_ATTR = 'Неподустимое значние атрибута'
UNKNOWN_COMAND = 'Неизвестная команда'
SUCCESS = 'Команда выполнен успешно'
UNSORCE = 'Начальная и конечная станция не могут совпадать'
UNTYPE = 'Неизвестный тип аргумента'
DUBLEINFO = 'Станция уже существует, убедитесь что Вы правильно вводите данные'
SHORTINFO = 'Слишком короткая информация, имя не может быть меньше чем 5 символов'
CANNOTEMPTY = 'Имя не может быть пустым'
